;; -*- no-byte-compile: t; -*-

;; Code
;;(package! lsp-augment
;; :recipe (:host github :repo "rolandd/augment.vim"))
;;  :pin "06819e1158e75a3c264cf6776ce0b9bf2f69f241"
(package! copilot)
(package! astro-ts-mode)
(package! auto-rename-tag)
(package! colorful-mode)
(package! fancy-compilation)
(package! rainbow-delimiters)
(package! svelte-mode)
(package! string-inflection)
(package! tagedit)
(package! toggle-quotes)

;; Media
(package! mentor)
(package! spotify)
(package! versuri)

;; Games / Decoration
(package! 2048-game)
(package! blackjack)
(package! clippy)
(package! fireplace)
(package! gameoflife)
(package! klondike)
(package! nyan-mode)
(package! pacmacs)
(package! parrot)
(package! speed-type)
(package! sudoku)

;; System
(package! helm-system-packages)
(package! pkg-info)
(package! tldr)

;; UI
(package! annotate)
(package! beacon)
(package! bm)
(package! buffer-move)
(package! evil-matchit)
(package! evil-tutor)
(package! hungry-delete)
(package! move-text)
(package! multi-vterm)
(package! mwim)
(package! visual-regexp)
(package! which-key)

;; Web
(package! google-this)
